tap "epk/epk"
tap "homebrew/bundle"
brew "btop"
brew "lazygit"
brew "neovim"
brew "nvm"
brew "pyenv"
brew "starship"
brew "stow"
brew "uv"
cask "appcleaner"
cask "balenaetcher"
cask "helium-browser"
cask "brave-browser"
cask "discord"
cask "font-sf-mono-nerd-font"
cask "ghostty"
cask "gimp"
cask "hiddenbar"
cask "obsidian"
cask "postman"
cask "raycast"
cask "visual-studio-code"
# cask "vlc"
cask "disk-inventory-x"
cask "shottr"
cask "todoist-app"
cask "zoom"
cask "slack"
