tap "airbrake/airbrake-cli"
tap "epk/epk"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "teamookla/speedtest"
brew "bat"
brew "btop"
brew "glib"
brew "cmatrix"
brew "curl"
brew "git"
brew "groovy"
brew "htop"
brew "hugo"
brew "imagemagick"
brew "libpq"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node"
brew "nvm"
brew "pfetch"
brew "pyenv"
brew "redis"
brew "starship"
brew "swagger-codegen"
brew "tmux"
brew "tree"
brew "wget"
brew "airbrake/airbrake-cli/airbrake"
brew "teamookla/speedtest/speedtest"
cask "brave-browser"
cask "discord"
cask "disk-inventory-x"
cask "dozer"
cask "firefox"
cask "font-sf-mono-nerd-font"
cask "kitty"
cask "notion"
cask "powershell"
cask "raycast"
cask "slack"
cask "spotify"
cask "stats"
cask "sublime-text"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
