tap "epk/epk"
tap "homebrew/bundle"
tap "nikolaeu/numi"
brew "btop"
brew "fileicon"
brew "neovim"
brew "nvm"
brew "pandoc"
brew "pyenv"
brew "starship"
cask "appcleaner"
cask "balenaetcher"
cask "brave-browser"
cask "discord"
cask "firefox"
cask "font-sf-mono-nerd-font"
cask "ghostty"
cask "gimp"
cask "hiddenbar"
cask "intellij-idea-ce"
cask "notion"
cask "postman"
cask "raycast"
cask "visual-studio-code"